EDT/МПСтриж/src/InformationRegisters/ПараметрыЧеков/ПараметрыЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЧеков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ККТ</name>
    <type>
      <types>CatalogRef.ККТ</types>
    </type>
  </resources>
  <resources>
    <name>ФН</name>
    <type>
      <types>CatalogRef.ФН</types>
    </type>
  </resources>
  <resources>
    <name>ФПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧекНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЧека</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Кассиры</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>СуммаАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЧекКПечати</name>
    <type>
      <types>DocumentRef.ЧекКПечатиВозвратПрихода</types>
      <types>DocumentRef.ЧекКПечати</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/Documents/ЧекКПечати/ЧекКПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекКПечати</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧекаНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеЗаказа</name>
    <type>
      <types>DocumentRef.ДанныеЗаказаВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекАннулирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПробитНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>КодНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Documents/ЧекКПечатиВозвратПрихода/ЧекКПечатиВозвратПрихода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекКПечатиВозвратПрихода</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧекаНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеЗаказа</name>
    <type>
      <types>DocumentRef.ДанныеЗаказаВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекКПечати</name>
    <type>
      <types>DocumentRef.ЧекКПечати</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>КодНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/Catalogs/ККТ/ККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ККТ</name>
  <attributes>
    <name>РегистрационныйНомерККТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомерККТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженоВСервисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетСБП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_merchantId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>assist_password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиAssistПоТерминалам</name>
    <attributes>
      <name>РегионДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>MerchantId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>login</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>password</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/МПСтриж/src/CommonModules/РаботаСЧекамиСервер/Module.bsl
Процедура ЗаписатьПараметрыЧекаВРС(Чек, ПараметрыЧека) Экспорт
	Наб = РегистрыСведений.ПараметрыЧеков.СоздатьНаборЗаписей();
	
	Наб.Отбор.ЧекКПечати.Установить(Чек);
	
	Нов = Наб.Добавить();
	Нов.ЧекКПечати = Чек;
	Нов.ДатаЧека = ПараметрыЧека.time;
	Нов.ККТ = ПолучитьККТ(ПараметрыЧека);
	Нов.НомерСмены = ПараметрыЧека.numberOperationShift;
	Нов.НомерЧека = ПараметрыЧека.numberCheck;
	Нов.Период = ТекущаяДата();
	Нов.СуммаЧека = ПараметрыЧека.sumCheck;
	Нов.ТипЧека = ПараметрыЧека.typeCheck;
	Нов.ФД = ПараметрыЧека.fd;
	Нов.ФН = ПолучитьФН(ПараметрыЧека);
	Нов.ФПД = ПараметрыЧека.fpd;
	Нов.Кассир = ПолучитьКассира(ПараметрыЧека);
	Нов.Организация = ПолучитьОрганизацию(ПараметрыЧека);
	
	Если Чек.ДанныеЗаказа.Реализация.ТипОплаты = Справочники.ТипыОплат.ОплаченоВМагазине Тогда
		Нов.СуммаАванса = Нов.СуммаЧека;
	КонецеСли;	
	
	Наб.Записать();
	
	ОбъектЧек = Чек.ПолучитьОбъект();
	ОбъектЧек.ЧекНапечатан = Истина;
	
	Для Каждого Тек Из ПараметрыЧека.Налоги Цикл
		Нов = ОбъектЧек.Налоги.Добавить();
		Нов.КодНалога = Тек.КодНалога;
		Нов.СуммаНалога = Тек.СуммаНалога;
	КонецЦикла;	
	
	ОбъектЧек.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры	

Функция ПолучитьККТ(ПараметрыЧека) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ККТ.Ссылка
	            |ИЗ
	            |	Справочник.ККТ КАК ККТ
	            |ГДЕ
	            |	ККТ.РегистрационныйНомерККТ = &РегистрационныйНомерККТ
	            |	И ККТ.ЗаводскойНомерККТ = &ЗаводскойНомерККТ";
	Зап.УстановитьПараметр("РегистрационныйНомерККТ", ПараметрыЧека.rn_kkt);
	Зап.УстановитьПараметр("ЗаводскойНомерККТ", ПараметрыЧека.fn_kkt);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Возврат Выб.Ссылка;
	КонецеСли;
	
	Нов = Справочники.ККТ.СоздатьЭлемент();
	Нов.РегистрационныйНомерККТ = ПараметрыЧека.rn_kkt;
	Нов.ЗаводскойНомерККТ = ПараметрыЧека.fn_kkt;
	Нов.Наименование = ПараметрыЧека.fn_kkt;
	Нов.Записать();
	
	Возврат Нов.Ссылка;
КонецФункции

Функция ПолучитьФН(ПараметрыЧека) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ФН.Ссылка
	            |ИЗ
	            |	Справочник.ФН КАК ФН
	            |ГДЕ
	            |	ФН.НомерФН = &НомерФН";
	Зап.УстановитьПараметр("НомерФН", ПараметрыЧека.fn);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Возврат Выб.Ссылка;
	КонецеСли;
	
	Нов = Справочники.ФН.СоздатьЭлемент();
	Нов.НомерФН = ПараметрыЧека.fn;
	Нов.Наименование = ПараметрыЧека.fn;
	Нов.Записать();
	
	Возврат Нов.Ссылка;
КонецФункции	


Функция ПолучитьКассира(ПараметрыЧека) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Кассиры.Ссылка КАК Ссылка
	            |ИЗ
	            |	Справочник.Кассиры КАК Кассиры
	            |ГДЕ
	            |	Кассиры.Наименование = &ФИО";
	Зап.УстановитьПараметр("ФИО", ПараметрыЧека.kassir);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Возврат Выб.Ссылка;
	КонецеСли;
	
	Нов = Справочники.Кассиры.СоздатьЭлемент();
	Нов.Наименование = ПараметрыЧека.kassir;
	Нов.Записать();
	
	Возврат Нов.Ссылка;
КонецФункции	

Функция ПолучитьОрганизацию(ПараметрыЧека) Экспорт
	Зап = Новый Запрос;
	//Зап.Текст = "ВЫБРАТЬ
	//            |	Организации.Ссылка КАК Ссылка
	//            |ИЗ
	//            |	Справочник.Организации КАК Организации
	//            |ГДЕ
	//            |	Организации.НаименованиеПолное = &НаименованиеПолное
	//            |	И Организации.ИНН = &ИНН";
	//Зап.УстановитьПараметр("НаименованиеПолное", ПараметрыЧека.organisation);
	
	Зап.Текст = "ВЫБРАТЬ
	            |	Организации.Ссылка КАК Ссылка
	            |ИЗ
	            |	Справочник.Организации КАК Организации
	            |ГДЕ
	            |	Организации.Наименование = &Наименование
	            |	И Организации.ИНН = &ИНН
	            |	И Организации.ПометкаУдаления = ЛОЖЬ";
	Зап.УстановитьПараметр("Наименование", ПараметрыЧека.organisation);
	
	
	Зап.УстановитьПараметр("ИНН", ПараметрыЧека.innOrganisation);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Возврат Выб.Ссылка;
	КонецеСли;
	
	Нов = Справочники.Организации.СоздатьЭлемент();
	Нов.Наименование = ПараметрыЧека.organisation;
	Нов.НаименованиеПолное = ПараметрыЧека.organisation;
	Нов.ИНН = ПараметрыЧека.innOrganisation;
	Нов.Записать();
	
	Возврат Нов.Ссылка;
КонецФункции

Процедура ЗаписьСтатусаЧекНапечатан(Чек) Экспорт
	Наб = РегистрыСведений.ПараметрыЧеков.СоздатьНаборЗаписей();
	ТекД = ТекущаяДата() + 1;
	Наб.Отбор.ЧекКПечати.Установить(Чек);
	Наб.Отбор.Период.Установить(ТекД);
	
	
	Нов = Наб.Добавить();
	Нов.Период = ТекД;
	Нов.ЧекКПечати = Чек;
	Нов.ЧекНапечатан = Истина;
	Наб.Записать();
КонецПроцедуры	

Функция СформироватьТекстЧека_До_2_0_5_2(Чек) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыЧеков.ККТ.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	            |	ПараметрыЧеков.ФПД КАК ФПД,
	            |	ПараметрыЧеков.ФД КАК ФД,
	            |	ПараметрыЧеков.НомерЧека КАК НомерЧека,
	            |	ПараметрыЧеков.НомерСмены КАК НомерСмены,
	            |	ПараметрыЧеков.ЧекНапечатан КАК ЧекНапечатан,
	            |	ПараметрыЧеков.ТипЧека КАК ТипЧека,
	            |	ПараметрыЧеков.ДатаЧека КАК ДатаЧека,
	            |	ПараметрыЧеков.СуммаЧека КАК СуммаЧека,
	            |	ПараметрыЧеков.ККТ.ЗаводскойНомерККТ КАК ЗаводскойНомерККТ,
	            |	ПараметрыЧеков.ФН.НомерФН КАК НомерФН,
	            |	ПараметрыЧеков.Кассир.Наименование КАК Кассир,
	            |	ПараметрыЧеков.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	            |	ПараметрыЧеков.Организация.ИНН КАК ОрганизацияИНН,
				|	ПараметрыЧеков.Организация.Адрес КАК ОрганизацияАдрес,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.НаименованиеПолное, """") КАК ПолноеНаименованиеПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ИНН, """") КАК ИННПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ЭтоАгрегатор, Ложь) КАК ПартнерЯвляетсяАгрегатором,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.Наименование, """") КАК НаименованиеПартнера,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.НомерКлиента КАК НомерЗаказа_ИМ,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Адрес КАК АдресМестаРасчетов
	            |ИЗ
	            |	РегистрСведений.ПараметрыЧеков КАК ПараметрыЧеков
	            |ГДЕ
	            |	ПараметрыЧеков.ЧекКПечати = &ЧекКПечати";
	
	Зап.УстановитьПараметр("ЧекКПечати", Чек);
	
	ВыбПарамЧек = Зап.Выполнить().Выбрать();
	
	Если Не ВыбПарамЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ЗапЧек = Новый Запрос;
	ЗапЧек.Текст = "ВЫБРАТЬ
	               |	ЧекКПечати.АдресОтправкиЧека КАК АдресОтправкиЧека,
	               |	ЧекКПечати.Товары.(
	               |		Номенклатура.Наименование КАК Товар,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		ЧекКПечати.Товары.Цена * ЧекКПечати.Товары.Количество КАК Сумма
	               |	) КАК Товары,
	               |	ЧекКПечати.ДанныеЗаказа.Реализация.СуммаДоставка КАК СтоимостьДоставки,
	               |	ЧекКПечати.ТипОплаты.Код КАК КодТипаОплаты,
	               |	ЧекКПечати.Налоги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВЫБОР
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = -1
	               |				ТОГДА ""Без НДС""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 0
	               |				ТОГДА ""Сумма НДС 0""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 10
	               |				ТОГДА ""Сумма НДС 10/110""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 18
	               |				ТОГДА ""Сумма НДС 18/118""
	               |		КОНЕЦ КАК КодНалога,
	               |		СуммаНалога КАК СуммаНалога
	               |	) КАК Налоги
	               |ИЗ
	               |	Документ.ЧекКПечати КАК ЧекКПечати
	               |ГДЕ
	               |	ЧекКПечати.Ссылка = &ЧекКПечати";
	
	ЗапЧек.УстановитьПараметр("ЧекКПечати", Чек);
	ВыбЧек = ЗапЧек.Выполнить().Выбрать();
	Если Не ВыбЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ТекстЧека = "   КАССОВЫЙ ЧЕК" + Символы.ПС;
	Если Строка(ВыбПарамЧек.ТипЧека) = "1" Тогда
		ТекстЧека = ТекстЧека + "ПРИХОД" + Символы.ПС;
	ИначеЕсли Строка(ВыбПарамЧек.ТипЧека) = "2" Тогда	
		ТекстЧека = ТекстЧека + "ВОЗВРАТ ПРИХОДА" + Символы.ПС;
	КонецеСли;	
		
	Товар = ВыбЧек.Товары.Выбрать();
	
	
	Пока Товар.Следующий() Цикл
		ТекстЧека = ТекстЧека + Товар.Товар + Символы.ПС;
		ТекстЧека = ТекстЧека + Формат(Товар.Количество, "ЧДЦ=3; ЧГ=") + " Х " + Формат(Товар.Цена, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(Товар.Сумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецЦикла;	
	
	ТекстЧека = ТекстЧека + "Доставка" + Символы.ПС;
	ТекстЧека = ТекстЧека + "1.000 Х " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	///итог
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	
	//оплата
	ТекстЧека = ТекстЧека + "ОПЛАТА" + Символы.ПС;
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	ТекстЧека = ТекстЧека + "ВСЕГО ОПЛАЧЕНО" + Символы.ПС;
	
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	//прочее
	ТекстЧека = ТекстЧека + "СНО: ОСН" + Символы.ПС;
	
	///налоги
	ВыбНал = ВыбЧек.Налоги.Выбрать();
	Пока ВыбНал.Следующий() Цикл
		ТекстЧека = ТекстЧека + ВыбНал.КодНалога + "  " + Формат(ВыбНал.СуммаНалога, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецЦикла;	
	
	
	
	ТекстЧека = ТекстЧека + "Эл. адрес покупателя: " + ВыбЧек.АдресОтправкиЧека +  Символы.ПС;
	ТекстЧека = ТекстЧека + "Сайт ФНС: www.nalog.ru" + Символы.ПС;
	ТекстЧека = ТекстЧека + "Агент: " + ВыбПарамЧек.ОрганизацияНаименование + Символы.ПС;
	ТекстЧека = ТекстЧека + "Адрес: " + ВыбПарамЧек.ОрганизацияАдрес + Символы.ПС;
	
	Если Не ВыбПарамЧек.ПартнерЯвляетсяАгрегатором	Тогда
		Если ЗначениеЗаполнено(ВыбПарамЧек.ПолноеНаименованиеПартнера) Тогда
			ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.ПолноеНаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
		ИначеЕсли ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
			ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.НаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
		КонецеСли;	
	КонецЕсли;
	
	
	ТекстЧека = ТекстЧека + "Номер заказа: " + СокрЛП(ВыбПарамЧек.НомерЗаказа_ИМ) + Символы.ПС;
	ТекстЧека = ТекстЧека + "Место расчетов: " + СокрЛП(ВыбПарамЧек.АдресМестаРасчетов) + Символы.ПС;
	
	
	//ТекстЧека = ТекстЧека + "ЭКИПАЖ" + Символы.ПС;
	ТекстЧека = ТекстЧека + "ИНН: " + ВыбПарамЧек.ОрганизацияИНН + Символы.ПС;
	ТекстЧека = ТекстЧека + "КАССИР: " + ВыбПарамЧек.Кассир + Символы.ПС;
	ТекстЧека = ТекстЧека + "ЗН. ККТ: " + ВыбПарамЧек.ЗаводскойНомерККТ + Символы.ПС;
	ТекстЧека = ТекстЧека + "Смена №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;
	//ТекстЧека = ТекстЧека + "Чек №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;   //непонятно, откуда брать
	
	// остальные параметры
	ТекстЧека = ТекстЧека + "" + Символы.ПС;
	ТекстЧека = ТекстЧека + "" + Символы.ПС;
	
	ТекстЧека = ТекстЧека + Формат(ВыбПарамЧек.ДатаЧека, "ДЛФ=DT") + Символы.ПС;
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ТекстЧека = ТекстЧека + "РН ККТ: " + ВыбПарамЧек.РегистрационныйНомерККТ + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФН №: " + ВыбПарамЧек.НомерФН + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФД №: " + ВыбПарамЧек.ФД + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФПД №: " + ВыбПарамЧек.ФПД + Символы.ПС;
	
	ВозврЗначение = Новый Структура;
	ВозврЗначение.Вставить("ТекстЧека", ТекстЧека);
	
	СтрокаШК = "t=" + Формат(Год(ВыбПарамЧек.ДатаЧека), "ЧГ=") + Формат(Месяц(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	СтрокаШК = СтрокаШК + "T" + Формат(Час(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(Минута(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	
	СтрокаШК = СтрокаШК + "&s=" + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
	СтрокаШК = СтрокаШК + "&fn=" + ВыбПарамЧек.НомерФН;
	СтрокаШК = СтрокаШК + "&i=" + ВыбПарамЧек.ФД;
	СтрокаШК = СтрокаШК + "&fp=" + ВыбПарамЧек.ФПД;
	СтрокаШК = СтрокаШК + "&n=" + Строка(ВыбПарамЧек.ТипЧека);
	
	ВозврЗначение.Вставить("СтрокаШК", СтрокаШК);

	
	Возврат ВозврЗначение;

КонецФункции	

Процедура ОчисткаСтарыхДанныхПоЧекам() Экспорт
    Попытка
        Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ
                       |	ПараметрыЧеков.Период
                       |ИЗ
                       |	РегистрСведений.ПараметрыЧеков КАК ПараметрыЧеков
                       |ГДЕ
                       |	ПараметрыЧеков.Период МЕЖДУ &ДатаНач И &ДатаКон";
        
        
        Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата() - 259200);
        Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата() - 864000);
        
        РезультатЗапроса = Запрос.Выполнить();
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            НаборЗаписей = РегистрыСведений.ПараметрыЧеков.СоздатьНаборЗаписей();
            НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
            НаборЗаписей.Записать();
        КонецЦикла;
        
        
    Исключение
    КонецПопытки;	
КонецПроцедуры	


Функция СформироватьТекстВозвратногоЧека_До_2_0_5_2(Чек) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыЧеков.ККТ.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	            |	ПараметрыЧеков.ФПД КАК ФПД,
	            |	ПараметрыЧеков.ФД КАК ФД,
	            |	ПараметрыЧеков.НомерЧека КАК НомерЧека,
	            |	ПараметрыЧеков.НомерСмены КАК НомерСмены,
	            |	ПараметрыЧеков.ЧекНапечатан КАК ЧекНапечатан,
	            |	ПараметрыЧеков.ТипЧека КАК ТипЧека,
	            |	ПараметрыЧеков.ДатаЧека КАК ДатаЧека,
	            |	ПараметрыЧеков.СуммаЧека КАК СуммаЧека,
	            |	ПараметрыЧеков.ККТ.ЗаводскойНомерККТ КАК ЗаводскойНомерККТ,
	            |	ПараметрыЧеков.ФН.НомерФН КАК НомерФН,
	            |	ПараметрыЧеков.Кассир.Наименование КАК Кассир,
	            |	ПараметрыЧеков.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	            |	ПараметрыЧеков.Организация.ИНН КАК ОрганизацияИНН,
				|	ПараметрыЧеков.Организация.Адрес КАК ОрганизацияАдрес,				
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.НаименованиеПолное, """") КАК ПолноеНаименованиеПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ИНН, """") КАК ИННПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ЭтоАгрегатор, Ложь) КАК ПартнерЯвляетсяАгрегатором,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.Наименование, """") КАК НаименованиеПартнера,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.НомерКлиента КАК НомерЗаказа_ИМ,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Адрес КАК АдресМестаРасчетов
	            |ИЗ
	            |	РегистрСведений.ПараметрыЧеков КАК ПараметрыЧеков
	            |ГДЕ
	            |	ПараметрыЧеков.ЧекКПечати = &ЧекКПечати";
	
	Зап.УстановитьПараметр("ЧекКПечати", Чек);
	
	ВыбПарамЧек = Зап.Выполнить().Выбрать();
	
	Если Не ВыбПарамЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ЗапЧек = Новый Запрос;
	ЗапЧек.Текст = "ВЫБРАТЬ
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.АдресОтправкиЧека Как АдресОтправкиЧека,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.Товары.(
	               |		Номенклатура.Наименование КАК Товар,
	               |		Количество,
	               |		Цена,
	               |		ЧекКПечати.Товары.Цена * ЧекКПечати.Товары.Количество КАК Сумма
	               |	) Как Товары,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ДанныеЗаказа.Реализация.СуммаДоставка КАК СтоимостьДоставки,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ТипОплаты.Код КАК КодТипаОплаты,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВЫБОР
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = -1
	               |				ТОГДА ""Без НДС""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 0
	               |				ТОГДА ""Сумма НДС 0""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 10
	               |				ТОГДА ""Сумма НДС 10/110""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 18
	               |				ТОГДА ""Сумма НДС 18/118""
	               |		КОНЕЦ КАК КодНалога,
	               |		СуммаНалога КАК СуммаНалога
	               |	) КАК Налоги
				   
	               |ИЗ
	               |	Документ.ЧекКПечатиВозвратПрихода КАК ЧекКПечатиВозвратПрихода
	               |ГДЕ
	               |	ЧекКПечатиВозвратПрихода.Ссылка = &ЧекКПечати";
	
	ЗапЧек.УстановитьПараметр("ЧекКПечати", Чек);
	ВыбЧек = ЗапЧек.Выполнить().Выбрать();
	Если Не ВыбЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ТекстЧека = "   КАССОВЫЙ ЧЕК" + Символы.ПС;
	Если Строка(ВыбПарамЧек.ТипЧека) = "1" Тогда
		ТекстЧека = ТекстЧека + "ПРИХОД" + Символы.ПС;
	ИначеЕсли Строка(ВыбПарамЧек.ТипЧека) = "2" Тогда	
		ТекстЧека = ТекстЧека + "ВОЗВРАТ ПРИХОДА" + Символы.ПС;
	КонецеСли;	
		
	Товар = ВыбЧек.Товары.Выбрать();
	
	
	Пока Товар.Следующий() Цикл
		ТекстЧека = ТекстЧека + Товар.Товар + Символы.ПС;
		ТекстЧека = ТекстЧека + Формат(Товар.Количество, "ЧДЦ=3; ЧГ=") + " Х " + Формат(Товар.Цена, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(Товар.Сумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецЦикла;	
	
	ТекстЧека = ТекстЧека + "Доставка" + Символы.ПС;
	ТекстЧека = ТекстЧека + "1.000 Х " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	///итог
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	
	//оплата
	ТекстЧека = ТекстЧека + "ОПЛАТА" + Символы.ПС;
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	ТекстЧека = ТекстЧека + "ВСЕГО ОПЛАЧЕНО" + Символы.ПС;
	
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	//прочее
	ТекстЧека = ТекстЧека + "СНО: ОСН" + Символы.ПС;
	
	
	///налоги
	ВыбНал = ВыбЧек.Налоги.Выбрать();
	Пока ВыбНал.Следующий() Цикл
		ТекстЧека = ТекстЧека + ВыбНал.КодНалога + "  " + Формат(ВыбНал.СуммаНалога, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецЦикла;	
	
	
	ТекстЧека = ТекстЧека + "Эл. адрес покупателя: " + ВыбЧек.АдресОтправкиЧека +  Символы.ПС;
	ТекстЧека = ТекстЧека + "Сайт ФНС: www.nalog.ru" + Символы.ПС;
	ТекстЧека = ТекстЧека + "Агент: " + ВыбПарамЧек.ОрганизацияНаименование + Символы.ПС;
	ТекстЧека = ТекстЧека + "Адрес: " + ВыбПарамЧек.ОрганизацияАдрес + Символы.ПС;
	
	
	Если Не ВыбПарамЧек.ПартнерЯвляетсяАгрегатором	Тогда
		Если ЗначениеЗаполнено(ВыбПарамЧек.ПолноеНаименованиеПартнера) Тогда
			ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.ПолноеНаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
		ИначеЕсли ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
			ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.НаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
		КонецеСли;	
	КонецЕсли;
	
	
	ТекстЧека = ТекстЧека + "Номер заказа: " + СокрЛП(ВыбПарамЧек.НомерЗаказа_ИМ) + Символы.ПС;
	ТекстЧека = ТекстЧека + "Место расчетов: " + СокрЛП(ВыбПарамЧек.АдресМестаРасчетов) + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ЭКИПАЖ" + Символы.ПС;
	ТекстЧека = ТекстЧека + "ИНН: " + ВыбПарамЧек.ОрганизацияИНН + Символы.ПС;
	ТекстЧека = ТекстЧека + "КАССИР: " + ВыбПарамЧек.Кассир + Символы.ПС;
	ТекстЧека = ТекстЧека + "ЗН. ККТ: " + ВыбПарамЧек.ЗаводскойНомерККТ + Символы.ПС;
	ТекстЧека = ТекстЧека + "Смена №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;
	//ТекстЧека = ТекстЧека + "Чек №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;   //непонятно, откуда брать
	
	// остальные параметры
	ТекстЧека = ТекстЧека + "" + Символы.ПС;
	ТекстЧека = ТекстЧека + "" + Символы.ПС;
	
	ТекстЧека = ТекстЧека + Формат(ВыбПарамЧек.ДатаЧека, "ДЛФ=DT") + Символы.ПС;
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ТекстЧека = ТекстЧека + "РН ККТ: " + ВыбПарамЧек.РегистрационныйНомерККТ + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФН №: " + ВыбПарамЧек.НомерФН + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФД №: " + ВыбПарамЧек.ФД + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФПД №: " + ВыбПарамЧек.ФПД + Символы.ПС;
	
	ВозврЗначение = Новый Структура;
	ВозврЗначение.Вставить("ТекстЧека", ТекстЧека);
	
	СтрокаШК = "t=" + Формат(Год(ВыбПарамЧек.ДатаЧека), "ЧГ=") + Формат(Месяц(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	СтрокаШК = СтрокаШК + "T" + Формат(Час(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(Минута(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	
	СтрокаШК = СтрокаШК + "&s=" + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
	СтрокаШК = СтрокаШК + "&fn=" + ВыбПарамЧек.НомерФН;
	СтрокаШК = СтрокаШК + "&i=" + ВыбПарамЧек.ФД;
	СтрокаШК = СтрокаШК + "&fp=" + ВыбПарамЧек.ФПД;
	СтрокаШК = СтрокаШК + "&n=" + Строка(ВыбПарамЧек.ТипЧека);
	
	ВозврЗначение.Вставить("СтрокаШК", СтрокаШК);

	
	Возврат ВозврЗначение;

КонецФункции	




Функция СформироватьТекстЧека(Чек) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыЧеков.ККТ.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	            |	ПараметрыЧеков.ФПД КАК ФПД,
	            |	ПараметрыЧеков.ФД КАК ФД,
	            |	ПараметрыЧеков.НомерЧека КАК НомерЧека,
	            |	ПараметрыЧеков.НомерСмены КАК НомерСмены,
	            |	ПараметрыЧеков.ЧекНапечатан КАК ЧекНапечатан,
	            |	ПараметрыЧеков.ТипЧека КАК ТипЧека,
	            |	ПараметрыЧеков.ДатаЧека КАК ДатаЧека,
	            |	ПараметрыЧеков.СуммаЧека КАК СуммаЧека,
	            |	ПараметрыЧеков.ККТ.ЗаводскойНомерККТ КАК ЗаводскойНомерККТ,
	            |	ПараметрыЧеков.ФН.НомерФН КАК НомерФН,
	            |	ПараметрыЧеков.Кассир.Наименование КАК Кассир,
	            |	ПараметрыЧеков.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	            |	ПараметрыЧеков.Организация.ИНН КАК ОрганизацияИНН,
	            |	ПараметрыЧеков.Организация.Адрес КАК ОрганизацияАдрес,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.НаименованиеПолное, """") КАК ПолноеНаименованиеПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ИНН, """") КАК ИННПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ЭтоАгрегатор, ЛОЖЬ) КАК ПартнерЯвляетсяАгрегатором,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.Наименование, """") КАК НаименованиеПартнера,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.НомерКлиента КАК НомерЗаказа_ИМ,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Адрес КАК АдресМестаРасчетов,
	            |	ПараметрыЧеков.СуммаАванса КАК СуммаАванса,
				|	ПараметрыЧеков.ЧекКПечати.СуммаПредоплаты КАК СуммаПредоплаты,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.ИнтернетМагазин.НаименованиеПолное, """") КАК ИнтернетМагазинНаименование,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.ИнтернетМагазин.ИНН, """") КАК ИнтернетМагазинИНН
	            |ИЗ
	            |	РегистрСведений.ПараметрыЧеков КАК ПараметрыЧеков
	            |ГДЕ
	            |	ПараметрыЧеков.ЧекКПечати = &ЧекКПечати";
	
	Зап.УстановитьПараметр("ЧекКПечати", Чек);
	
	ВыбПарамЧек = Зап.Выполнить().Выбрать();
	
	Если Не ВыбПарамЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ЗапЧек = Новый Запрос;
	ЗапЧек.Текст = "ВЫБРАТЬ
	               |	ЧекКПечати.АдресОтправкиЧека КАК АдресОтправкиЧека,
	               |	ЧекКПечати.Товары.(
	               |		Номенклатура.Наименование КАК Товар,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		КодМаркировки КАК КодМаркировки,
				   |		ПоставщикТовара.ИНН КАК ИННПоставщика,
				   |		ПоставщикТовара.Наименование КАК НаименованиеПоставщика,
				   |		ПоставщикТовара.Телефон КАК ТелефонПоставщика,
				   |		СтавкаНДС КАК СтавкаНДС,
	               |		ЧекКПечати.Товары.Цена * ЧекКПечати.Товары.Количество КАК Сумма
	               |	) КАК Товары,
	               |	ЧекКПечати.ДанныеЗаказа.СуммаДоставка КАК СтоимостьДоставки,
				   |	ЧекКПечати.ДанныеЗаказа.Реализация.СтавкаНДСФЗПоДоставке КАК СтавкаНДСФЗПоДоставке,
	               |	ЧекКПечати.ТипОплаты.Код КАК КодТипаОплаты,
	               |	ЧекКПечати.Налоги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВЫБОР
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = -1
	               |				ТОГДА ""Без НДС""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 0
	               |				ТОГДА ""Сумма НДС 0""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 10
	               |				ТОГДА ""Сумма НДС 10/110""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 18
	               |				ТОГДА ""Сумма НДС 18/118""
	               |			КОГДА ЧекКПечати.Налоги.КодНалога = 20
	               |				ТОГДА ""Сумма НДС 20/120""
	               |		КОНЕЦ КАК КодНалога,
	               |		СуммаНалога КАК СуммаНалога
	               |	) КАК Налоги
	               |ИЗ
	               |	Документ.ЧекКПечати КАК ЧекКПечати
	               |ГДЕ
	               |	ЧекКПечати.Ссылка = &ЧекКПечати";
	
	ЗапЧек.УстановитьПараметр("ЧекКПечати", Чек);
	ВыбЧек = ЗапЧек.Выполнить().Выбрать();
	Если Не ВыбЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ТекстЧека = "   КАССОВЫЙ ЧЕК №" + ВыбПарамЧек.ФД + Символы.ПС;
	
	
	ТекстЧека = ТекстЧека + "Агент: " + ВыбПарамЧек.ОрганизацияНаименование + Символы.ПС;
	ТекстЧека = ТекстЧека + "Адрес: " + ВыбПарамЧек.ОрганизацияАдрес + Символы.ПС;
	
	ТекстЧека = ТекстЧека + "ИНН: " + ВыбПарамЧек.ОрганизацияИНН + Символы.ПС;

	
	
	//Если Не ВыбПарамЧек.ПартнерЯвляетсяАгрегатором	Тогда
	//	Если ЗначениеЗаполнено(ВыбПарамЧек.ПолноеНаименованиеПартнера) Тогда
	//		ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.ПолноеНаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
	//	ИначеЕсли ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
	//		ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.НаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
	//	КонецеСли;	
	//КонецЕсли;
	
	
	ТекстЧека = ТекстЧека + "Номер заказа: " + СокрЛП(ВыбПарамЧек.НомерЗаказа_ИМ) + Символы.ПС;
	
	
	Если Строка(ВыбПарамЧек.ТипЧека) = "1" Тогда
		ТекстЧека = ТекстЧека + "ПРИХОД" + Символы.ПС;
	ИначеЕсли Строка(ВыбПарамЧек.ТипЧека) = "2" Тогда	
		ТекстЧека = ТекстЧека + "ВОЗВРАТ ПРИХОДА" + Символы.ПС;
	КонецеСли;	
	
	
	ТекстЧека = ТекстЧека + Формат(ВыбПарамЧек.ДатаЧека, "ДЛФ=DT") + Символы.ПС;
	
	
		
	Товар = ВыбЧек.Товары.Выбрать();
	
	Пока Товар.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Товар.Количество) Тогда
			Продолжить;
		КонецеСли;
		
		ТекстЧека = ТекстЧека + Товар.Товар + Символы.ПС;
		
		Если ЗначениеЗаполнено(Товар.КодМаркировки) Тогда
			ТекстЧека = ТекстЧека + " [М] ";
		КонецеСли;	
		
		
		ТекстЧека = ТекстЧека + Формат(Товар.Количество, "ЧДЦ=3; ЧГ=") + " Х " + Формат(Товар.Цена, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(Товар.Сумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		//Если ЗначениеЗаполнено(Товар.КодМаркировки) Тогда
		//	ТекстЧека = ТекстЧека + "КМ: " + Товар.КодМаркировки + Символы.ПС;
		//КонецеСли;	
		
		Если ЗначениеЗаполнено(Товар.ИННПоставщика) Тогда
			ТекстЧека = ТекстЧека + "ИНН поставщика : " + Товар.ИННПоставщика;
			Если ЗначениеЗаполнено(Товар.НаименованиеПоставщика) Тогда
				ТекстЧека = ТекстЧека + ", Поставщик " + Товар.НаименованиеПоставщика;
			КонецЕсли;
			Если ЗначениеЗаполнено(Товар.ТелефонПоставщика) Тогда
				ТекстЧека = ТекстЧека + ", Тлф. Пост. " + Товар.ТелефонПоставщика;
			КонецЕсли;
			
			ТекстЧека = ТекстЧека + Символы.ПС;
		Иначе
			ИННПоставщика = "";
			Если ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
				ИННПоставщика = ВыбПарамЧек.ИННПартнера;
			Иначе
				ИННПоставщика = ВыбПарамЧек.ИнтернетМагазинИНН;
			КонецеСли;	
			
			ТекстЧека = ТекстЧека + "ИНН поставщика : " + ИННПоставщика + Символы.ПС;
		КонецеСли;	

		Если Товар.СтавкаНДС = -1 Тогда
			СтавкаНДСВОтблеск = "не облагается";
		Иначе
			СтавкаНДСВОтблеск = Строка(Товар.СтавкаНДС) + "%";
		КонецЕсли;	
		ТекстЧека = ТекстЧека + "Ставка НДС: " + СтавкаНДСВОтблеск + Символы.ПС;
	КонецЦикла;	
	
	Если ВыбЧек.СтоимостьДоставки <> 0 Тогда
		ТекстЧека = ТекстЧека + "Доставка" + Символы.ПС;
		ТекстЧека = ТекстЧека + "1.000 Х " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ИННПоДоставке = "";
		Если ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
			ИННПоДоставке = ВыбПарамЧек.ИННПартнера;
		Иначе
			ИННПоДоставке = ВыбПарамЧек.ИнтернетМагазинИНН;
		КонецеСли;	
		
		ТекстЧека = ТекстЧека + "ИНН поставщика : " + ИННПоДоставке + Символы.ПС;
		
		Если ВыбЧек.СтавкаНДСФЗПоДоставке = -1 Тогда
			СтавкаНДСВОтблеск = "не облагается";
		Иначе
			СтавкаНДСВОтблеск = Строка(ВыбЧек.СтавкаНДСФЗПоДоставке) + "%";
		КонецЕсли;	
		ТекстЧека = ТекстЧека + "Ставка НДС: " + СтавкаНДСВОтблеск + Символы.ПС;
	КонецеСли;	
	
	///итог
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	
	///налоги
	ИтНДС = 0;
	ВыбНал = ВыбЧек.Налоги.Выбрать();
	Пока ВыбНал.Следующий() Цикл
		//ТекстЧека = ТекстЧека + ВыбНал.КодНалога + "  " + Формат(ВыбНал.СуммаНалога, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ИтНДС = ИтНДС + ВыбНал.СуммаНалога;
	КонецЦикла;	
	
	
	
	
	//оплата
	ТекстЧека = ТекстЧека + "ОПЛАТА" + Символы.ПС;
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	ТекстЧека = ТекстЧека + "ВСЕГО ОПЛАЧЕНО" + Символы.ПС;
	
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;	
	
	//новые налоги
	ИтогоПоЧекуСумма = ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты - ИтНДС;
	ТекстЧека = ТекстЧека + "ИТОГО БЕЗ НДС: " + Формат(ИтогоПоЧекуСумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	
	ТекстЧека = ТекстЧека + "АВАНС = " +  Формат(Макс(ВыбПарамЧек.СуммаАванса, ВыбПарамЧек.СуммаПредоплаты), "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;	
	
	ТекстЧека = ТекстЧека + "Место расчетов: " + СокрЛП(ВыбПарамЧек.АдресМестаРасчетов) + Символы.ПС;
	
	
	
	
	//прочее
	ТекстЧека = ТекстЧека + "СНО: ОСН" + Символы.ПС;
	
	
	
	
	ТекстЧека = ТекстЧека + "Эл. адрес покупателя: " + ВыбЧек.АдресОтправкиЧека +  Символы.ПС;
	ТекстЧека = ТекстЧека + "Эл. адрес отправителя: noreply@platformaofd.ru" +  Символы.ПС;
	ТекстЧека = ТекстЧека + "Сайт ФНС: www.nalog.ru" + Символы.ПС;
	
	
	//ТекстЧека = ТекстЧека + "Код формы ФД: " + Символы.ПС;
	ТекстЧека = ТекстЧека + "Версия ФФД: 1.05" + Символы.ПС;
	
	// остальные параметры
	ТекстЧека = ТекстЧека + "" + Символы.ПС;
	ТекстЧека = ТекстЧека + "" + Символы.ПС;

	
	
	ТекстЧека = ТекстЧека + "Смена №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;	
	//ТекстЧека = ТекстЧека + "ЭКИПАЖ" + Символы.ПС;
	ТекстЧека = ТекстЧека + "КАССИР: " + ВыбПарамЧек.Кассир + Символы.ПС;
	ТекстЧека = ТекстЧека + "РН ККТ: " + ВыбПарамЧек.РегистрационныйНомерККТ + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФН №: " + ВыбПарамЧек.НомерФН + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФД №: " + ВыбПарамЧек.ФД + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФПД №: " + ВыбПарамЧек.ФПД + Символы.ПС;
	ТекстЧека = ТекстЧека + "ЗН. ККТ: " + ВыбПарамЧек.ЗаводскойНомерККТ + Символы.ПС;
	
	//ТекстЧека = ТекстЧека + "Чек №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;   //непонятно, откуда брать
	
	
	
	
	ВозврЗначение = Новый Структура;
	ВозврЗначение.Вставить("ТекстЧека", ТекстЧека);
	
	СтрокаШК = "t=" + Формат(Год(ВыбПарамЧек.ДатаЧека), "ЧГ=") + Формат(Месяц(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	СтрокаШК = СтрокаШК + "T" + Формат(Час(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(Минута(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	
	СтрокаШК = СтрокаШК + "&s=" + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
	СтрокаШК = СтрокаШК + "&fn=" + ВыбПарамЧек.НомерФН;
	СтрокаШК = СтрокаШК + "&i=" + Формат(ВыбПарамЧек.ФД, "ЧГ=");
	СтрокаШК = СтрокаШК + "&fp=" + ВыбПарамЧек.ФПД;
	СтрокаШК = СтрокаШК + "&n=" + Строка(ВыбПарамЧек.ТипЧека);
	
	ВозврЗначение.Вставить("СтрокаШК", СтрокаШК);

	
	Возврат ВозврЗначение;

КонецФункции	

Функция СформироватьТекстВозвратногоЧека(Чек) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыЧеков.ККТ.РегистрационныйНомерККТ КАК РегистрационныйНомерККТ,
	            |	ПараметрыЧеков.ФПД КАК ФПД,
	            |	ПараметрыЧеков.ФД КАК ФД,
	            |	ПараметрыЧеков.НомерЧека КАК НомерЧека,
	            |	ПараметрыЧеков.НомерСмены КАК НомерСмены,
	            |	ПараметрыЧеков.ЧекНапечатан КАК ЧекНапечатан,
	            |	ПараметрыЧеков.ТипЧека КАК ТипЧека,
	            |	ПараметрыЧеков.ДатаЧека КАК ДатаЧека,
	            |	ПараметрыЧеков.СуммаЧека КАК СуммаЧека,
	            |	ПараметрыЧеков.ККТ.ЗаводскойНомерККТ КАК ЗаводскойНомерККТ,
	            |	ПараметрыЧеков.ФН.НомерФН КАК НомерФН,
	            |	ПараметрыЧеков.Кассир.Наименование КАК Кассир,
	            |	ПараметрыЧеков.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	            |	ПараметрыЧеков.Организация.ИНН КАК ОрганизацияИНН,
	            |	ПараметрыЧеков.Организация.Адрес КАК ОрганизацияАдрес,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.НаименованиеПолное, """") КАК ПолноеНаименованиеПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ИНН, """") КАК ИННПартнера,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ЭтоАгрегатор, ЛОЖЬ) КАК ПартнерЯвляетсяАгрегатором,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.Наименование, """") КАК НаименованиеПартнера,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.НомерКлиента КАК НомерЗаказа_ИМ,
	            |	ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.Адрес КАК АдресМестаРасчетов,
	            |	ПараметрыЧеков.СуммаАванса КАК СуммаАванса,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.СуммаПредоплаты, 0) КАК СуммаПредоплаты,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.ИнтернетМагазин.НаименованиеПолное, """") КАК ИнтернетМагазинНаименование,
	            |	ЕСТЬNULL(ПараметрыЧеков.ЧекКПечати.ДанныеЗаказа.Реализация.ИнтернетМагазин.ИНН, """") КАК ИнтернетМагазинИНН
	            |ИЗ
	            |	РегистрСведений.ПараметрыЧеков КАК ПараметрыЧеков
	            |ГДЕ
	            |	ПараметрыЧеков.ЧекКПечати = &ЧекКПечати";
	
	Зап.УстановитьПараметр("ЧекКПечати", Чек);
	
	ВыбПарамЧек = Зап.Выполнить().Выбрать();
	
	Если Не ВыбПарамЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	ЗапЧек = Новый Запрос;
	ЗапЧек.Текст = "ВЫБРАТЬ
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.АдресОтправкиЧека КАК АдресОтправкиЧека,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.Товары.(
	               |		Номенклатура.Наименование КАК Товар,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		КодМаркировки КАК КодМаркировки,
				   |		ПоставщикТовара.ИНН КАК ИННПоставщика,
				   |		ПоставщикТовара.Наименование КАК НаименованиеПоставщика,
				   |		ПоставщикТовара.Телефон КАК ТелефонПоставщика,
				   |		СтавкаНДС КАК СтавкаНДС,
	               |		ЧекКПечатиВозвратПрихода.ЧекКПечати.Товары.Цена * ЧекКПечатиВозвратПрихода.ЧекКПечати.Товары.Количество КАК Сумма
	               |	) КАК Товары,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ДанныеЗаказа.СуммаДоставка КАК СтоимостьДоставки,
				   |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ДанныеЗаказа.Реализация.СтавкаНДСФЗПоДоставке КАК СтавкаНДСФЗПоДоставке,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ТипОплаты.Код КАК КодТипаОплаты,
	               |	ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВЫБОР
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = -1
	               |				ТОГДА ""Без НДС""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 0
	               |				ТОГДА ""Сумма НДС 0""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 10
	               |				ТОГДА ""Сумма НДС 10/110""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 18
	               |				ТОГДА ""Сумма НДС 18/118""
	               |			КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.Налоги.КодНалога = 20
	               |				ТОГДА ""Сумма НДС 20/120""
	               |		КОНЕЦ КАК КодНалога,
	               |		СуммаНалога КАК СуммаНалога
	               |	) КАК Налоги
	               |ИЗ
	               |	Документ.ЧекКПечатиВозвратПрихода КАК ЧекКПечатиВозвратПрихода
	               |ГДЕ
	               |	ЧекКПечатиВозвратПрихода.Ссылка = &ЧекКПечати";
	
	ЗапЧек.УстановитьПараметр("ЧекКПечати", Чек);
	ВыбЧек = ЗапЧек.Выполнить().Выбрать();
	Если Не ВыбЧек.Следующий() Тогда
		Возврат Неопределено;
	КонецеСли;	
	
	//ТекстЧека = "   КАССОВЫЙ ЧЕК" + Символы.ПС;
	//Если Строка(ВыбПарамЧек.ТипЧека) = "1" Тогда
	//	ТекстЧека = ТекстЧека + "ПРИХОД" + Символы.ПС;
	//ИначеЕсли Строка(ВыбПарамЧек.ТипЧека) = "2" Тогда	
	//	ТекстЧека = ТекстЧека + "ВОЗВРАТ ПРИХОДА" + Символы.ПС;
	//КонецеСли;	
	//	
	//Товар = ВыбЧек.Товары.Выбрать();
	//
	//
	//Пока Товар.Следующий() Цикл
	//	ТекстЧека = ТекстЧека + Товар.Товар + Символы.ПС;
	//	ТекстЧека = ТекстЧека + Формат(Товар.Количество, "ЧДЦ=3; ЧГ=") + " Х " + Формат(Товар.Цена, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(Товар.Сумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//КонецЦикла;	
	//
	//ТекстЧека = ТекстЧека + "Доставка" + Символы.ПС;
	//ТекстЧека = ТекстЧека + "1.000 Х " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//
	/////итог
	//ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//
	//
	////оплата
	//ТекстЧека = ТекстЧека + "ОПЛАТА" + Символы.ПС;
	//Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
	//	ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
	//	ТекстЧека = ТекстЧека + " ЭЛЕКТРОННЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//КонецеСли;	
	//
	//ТекстЧека = ТекстЧека + "ВСЕГО ОПЛАЧЕНО" + Символы.ПС;
	//
	//Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
	//	ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//	ТекстЧека = ТекстЧека + " ЭЛЕКТРОННЫМИ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
	//	ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//	ТекстЧека = ТекстЧека + " ЭЛЕКТРОННЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//КонецеСли;	
	//
	////прочее
	//ТекстЧека = ТекстЧека + "СНО: ОСН" + Символы.ПС;
	//
	//
	/////налоги
	//ВыбНал = ВыбЧек.Налоги.Выбрать();
	//Пока ВыбНал.Следующий() Цикл
	//	ТекстЧека = ТекстЧека + ВыбНал.КодНалога + "  " + Формат(ВыбНал.СуммаНалога, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//КонецЦикла;	
	//
	//
	//ТекстЧека = ТекстЧека + "Эл. адрес покупателя: " + ВыбЧек.АдресОтправкиЧека +  Символы.ПС;
	//ТекстЧека = ТекстЧека + "Сайт ФНС: www.nalog.ru" + Символы.ПС;
	//ТекстЧека = ТекстЧека + "Агент: " + ВыбПарамЧек.ОрганизацияНаименование + Символы.ПС;
	//ТекстЧека = ТекстЧека + "Адрес: " + ВыбПарамЧек.ОрганизацияАдрес + Символы.ПС;
	//
	//
	//Если Не ВыбПарамЧек.ПартнерЯвляетсяАгрегатором	Тогда
	//	Если ЗначениеЗаполнено(ВыбПарамЧек.ПолноеНаименованиеПартнера) Тогда
	//		ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.ПолноеНаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
	//	ИначеЕсли ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
	//		ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.НаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
	//	КонецеСли;	
	//КонецЕсли;
	//
	//
	//ТекстЧека = ТекстЧека + "Номер заказа: " + СокрЛП(ВыбПарамЧек.НомерЗаказа_ИМ) + Символы.ПС;
	//ТекстЧека = ТекстЧека + "Место расчетов: " + СокрЛП(ВыбПарамЧек.АдресМестаРасчетов) + Символы.ПС;
	////ТекстЧека = ТекстЧека + "ЭКИПАЖ" + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ИНН: " + ВыбПарамЧек.ОрганизацияИНН + Символы.ПС;
	//ТекстЧека = ТекстЧека + "КАССИР: " + ВыбПарамЧек.Кассир + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ЗН. ККТ: " + ВыбПарамЧек.ЗаводскойНомерККТ + Символы.ПС;
	//ТекстЧека = ТекстЧека + "Смена №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;
	////ТекстЧека = ТекстЧека + "Чек №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;   //непонятно, откуда брать
	//
	//// остальные параметры
	//ТекстЧека = ТекстЧека + "" + Символы.ПС;
	//ТекстЧека = ТекстЧека + "" + Символы.ПС;
	//
	//ТекстЧека = ТекстЧека + Формат(ВыбПарамЧек.ДатаЧека, "ДЛФ=DT") + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	//ТекстЧека = ТекстЧека + "РН ККТ: " + ВыбПарамЧек.РегистрационныйНомерККТ + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ФН №: " + ВыбПарамЧек.НомерФН + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ФД №: " + ВыбПарамЧек.ФД + Символы.ПС;
	//ТекстЧека = ТекстЧека + "ФПД №: " + ВыбПарамЧек.ФПД + Символы.ПС;
	//
	//ВозврЗначение = Новый Структура;
	//ВозврЗначение.Вставить("ТекстЧека", ТекстЧека);
	//
	//СтрокаШК = "t=" + Формат(Год(ВыбПарамЧек.ДатаЧека), "ЧГ=") + Формат(Месяц(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	//СтрокаШК = СтрокаШК + "T" + Формат(Час(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(Минута(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	//
	//СтрокаШК = СтрокаШК + "&s=" + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
	//СтрокаШК = СтрокаШК + "&fn=" + ВыбПарамЧек.НомерФН;
	//СтрокаШК = СтрокаШК + "&i=" + ВыбПарамЧек.ФД;
	//СтрокаШК = СтрокаШК + "&fp=" + ВыбПарамЧек.ФПД;
	//СтрокаШК = СтрокаШК + "&n=" + Строка(ВыбПарамЧек.ТипЧека);
	//
	//ВозврЗначение.Вставить("СтрокаШК", СтрокаШК);

	//
	//Возврат ВозврЗначение;
	
	ТекстЧека = "   КАССОВЫЙ ЧЕК №" + ВыбПарамЧек.ФД + Символы.ПС;
	
	
	ТекстЧека = ТекстЧека + "Агент: " + ВыбПарамЧек.ОрганизацияНаименование + Символы.ПС;
	ТекстЧека = ТекстЧека + "Адрес: " + ВыбПарамЧек.ОрганизацияАдрес + Символы.ПС;
	
	ТекстЧека = ТекстЧека + "ИНН: " + ВыбПарамЧек.ОрганизацияИНН + Символы.ПС;

	
	
	//Если Не ВыбПарамЧек.ПартнерЯвляетсяАгрегатором	Тогда
	//	Если ЗначениеЗаполнено(ВыбПарамЧек.ПолноеНаименованиеПартнера) Тогда
	//		ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.ПолноеНаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
	//	ИначеЕсли ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
	//		ТекстЧека = ТекстЧека + "Продавец: " + ВыбПарамЧек.НаименованиеПартнера + ", ИНН " + ВыбПарамЧек.ИННПартнера + Символы.ПС;
	//	КонецеСли;	
	//КонецЕсли;
	
	
	ТекстЧека = ТекстЧека + "Номер заказа: " + СокрЛП(ВыбПарамЧек.НомерЗаказа_ИМ) + Символы.ПС;
	
	
	Если Строка(ВыбПарамЧек.ТипЧека) = "1" Тогда
		ТекстЧека = ТекстЧека + "ПРИХОД" + Символы.ПС;
	ИначеЕсли Строка(ВыбПарамЧек.ТипЧека) = "2" Тогда	
		ТекстЧека = ТекстЧека + "ВОЗВРАТ ПРИХОДА" + Символы.ПС;
	КонецеСли;	
	
	
	ТекстЧека = ТекстЧека + Формат(ВыбПарамЧек.ДатаЧека, "ДЛФ=DT") + Символы.ПС;
	
	
		
	Товар = ВыбЧек.Товары.Выбрать();
	
	
	Пока Товар.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Товар.Количество) Тогда
			Продолжить;
		КонецеСли;
		
		ТекстЧека = ТекстЧека + Товар.Товар + Символы.ПС;
		
		Если ЗначениеЗаполнено(Товар.КодМаркировки) Тогда
			ТекстЧека = ТекстЧека + " [М] ";
		КонецеСли;	

		
		ТекстЧека = ТекстЧека + Формат(Товар.Количество, "ЧДЦ=3; ЧГ=") + " Х " + Формат(Товар.Цена, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(Товар.Сумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		//Если ЗначениеЗаполнено(Товар.КодМаркировки) Тогда
		//	ТекстЧека = ТекстЧека + "КМ: " + Товар.КодМаркировки + Символы.ПС;
		//КонецеСли;	
		
		Если ЗначениеЗаполнено(Товар.ИННПоставщика) Тогда
			ТекстЧека = ТекстЧека + "ИНН поставщика : " + Товар.ИННПоставщика;
			Если ЗначениеЗаполнено(Товар.НаименованиеПоставщика) Тогда
				ТекстЧека = ТекстЧека + ", Поставщик " + Товар.НаименованиеПоставщика;
			КонецЕсли;
			Если ЗначениеЗаполнено(Товар.ТелефонПоставщика) Тогда
				ТекстЧека = ТекстЧека + ", Тлф. Пост. " + Товар.ТелефонПоставщика;
			КонецЕсли;
			
			ТекстЧека = ТекстЧека + Символы.ПС;
		Иначе
			ИННПоставщика = "";
			Если ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
				ИННПоставщика = ВыбПарамЧек.ИННПартнера;
			Иначе
				ИННПоставщика = ВыбПарамЧек.ИнтернетМагазинИНН;
			КонецеСли;	
			
			ТекстЧека = ТекстЧека + "ИНН поставщика : " + ИННПоставщика + Символы.ПС;			
		КонецеСли;	
		
		Если Товар.СтавкаНДС = -1 Тогда
			СтавкаНДСВОтблеск = "не облагается";
		Иначе
			СтавкаНДСВОтблеск = Строка(Товар.СтавкаНДС) + "%";
		КонецЕсли;	
		ТекстЧека = ТекстЧека + "Ставка НДС: " + СтавкаНДСВОтблеск + Символы.ПС;
		
	КонецЦикла;	
	
	Если ВыбЧек.СтоимостьДоставки <> 0 Тогда
		ТекстЧека = ТекстЧека + "Доставка" + Символы.ПС;
		ТекстЧека = ТекстЧека + "1.000 Х " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + " = " + Формат(ВыбЧек.СтоимостьДоставки, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ИННПоДоставке = "";
		Если ЗначениеЗаполнено(ВыбПарамЧек.НаименованиеПартнера) Тогда
			ИННПоДоставке = ВыбПарамЧек.ИННПартнера;
		Иначе
			ИННПоДоставке = ВыбПарамЧек.ИнтернетМагазинИНН;
		КонецеСли;	
		
		ТекстЧека = ТекстЧека + "ИНН поставщика : " + ИННПоДоставке + Символы.ПС;
		
		Если ВыбЧек.СтавкаНДСФЗПоДоставке = -1 Тогда
			СтавкаНДСВОтблеск = "не облагается";
		Иначе
			СтавкаНДСВОтблеск = Строка(ВыбЧек.СтавкаНДСФЗПоДоставке) + "%";
		КонецЕсли;	
		ТекстЧека = ТекстЧека + "Ставка НДС: " + СтавкаНДСВОтблеск + Символы.ПС;		
	КонецеСли;	
	
	///итог
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	
	//налоги
	ВыбНал = ВыбЧек.Налоги.Выбрать();
	ИтНДС = 0;
	Пока ВыбНал.Следующий() Цикл
		//ТекстЧека = ТекстЧека + ВыбНал.КодНалога + "  " + Формат(ВыбНал.СуммаНалога, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ИтНДС = ИтНДС + ВыбНал.СуммаНалога;
	КонецЦикла;	
	
	
	
	//оплата
	ТекстЧека = ТекстЧека + "ОПЛАТА" + Символы.ПС;
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	ТекстЧека = ТекстЧека + "ВСЕГО ОПЛАЧЕНО" + Символы.ПС;
	
	Если Число(ВыбЧек.КодТипаОплаты) = 1 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	ИначеЕсли Число(ВыбЧек.КодТипаОплаты) = 5 Тогда
		ТекстЧека = ТекстЧека + " НАЛИЧНЫЕ = " + Формат(0, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
		ТекстЧека = ТекстЧека + " БЕЗНАЛИЧНЫМИ = " + Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	КонецеСли;	
	
	
	ТекстЧека = ТекстЧека + "ИТОГ = " +  Формат(ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;	
	
	//новые налоги
	ИтогоПоЧекуСумма = ВыбПарамЧек.СуммаЧека + ВыбПарамЧек.СуммаПредоплаты - ИтНДС;
	ТекстЧека = ТекстЧека + "ИТОГО БЕЗ НДС: " + Формат(ИтогоПоЧекуСумма, "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;
	
	
	ТекстЧека = ТекстЧека + "АВАНС = " +  Формат(Макс(ВыбПарамЧек.СуммаАванса, ВыбПарамЧек.СуммаПредоплаты), "ЧДЦ=2; ЧН=0.00; ЧГ=") + Символы.ПС;	
	
	ТекстЧека = ТекстЧека + "Место расчетов: " + СокрЛП(ВыбПарамЧек.АдресМестаРасчетов) + Символы.ПС;
	
	
	
	
	//прочее
	ТекстЧека = ТекстЧека + "СНО: ОСН" + Символы.ПС;
	
	
	
	
	ТекстЧека = ТекстЧека + "Эл. адрес покупателя: " + ВыбЧек.АдресОтправкиЧека +  Символы.ПС;
	ТекстЧека = ТекстЧека + "Эл. адрес отправителя: noreply@platformaofd.ru" +  Символы.ПС;
	ТекстЧека = ТекстЧека + "Сайт ФНС: www.nalog.ru" + Символы.ПС;
	
	
	//ТекстЧека = ТекстЧека + "Код формы ФД: " + Символы.ПС;
	ТекстЧека = ТекстЧека + "Версия ФФД: 1.05" + Символы.ПС;
	
	// остальные параметры
	ТекстЧека = ТекстЧека + "" + Символы.ПС;
	ТекстЧека = ТекстЧека + "" + Символы.ПС;

	
	
	ТекстЧека = ТекстЧека + "Смена №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;	
	//ТекстЧека = ТекстЧека + "ЭКИПАЖ" + Символы.ПС;
	ТекстЧека = ТекстЧека + "КАССИР: " + ВыбПарамЧек.Кассир + Символы.ПС;
	ТекстЧека = ТекстЧека + "РН ККТ: " + ВыбПарамЧек.РегистрационныйНомерККТ + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФН №: " + ВыбПарамЧек.НомерФН + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФД №: " + ВыбПарамЧек.ФД + Символы.ПС;
	ТекстЧека = ТекстЧека + "ФПД №: " + ВыбПарамЧек.ФПД + Символы.ПС;
	ТекстЧека = ТекстЧека + "ЗН. ККТ: " + ВыбПарамЧек.ЗаводскойНомерККТ + Символы.ПС;
	
	//ТекстЧека = ТекстЧека + "Чек №: " + ВыбПарамЧек.НомерСмены + Символы.ПС;   //непонятно, откуда брать
	
	
	
	
	ВозврЗначение = Новый Структура;
	ВозврЗначение.Вставить("ТекстЧека", ТекстЧека);
	
	СтрокаШК = "t=" + Формат(Год(ВыбПарамЧек.ДатаЧека), "ЧГ=") + Формат(Месяц(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	СтрокаШК = СтрокаШК + "T" + Формат(Час(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(Минута(ВыбПарамЧек.ДатаЧека), "ЧЦ=2; ЧВН=; ЧГ=");
	
	СтрокаШК = СтрокаШК + "&s=" + Формат(ВыбПарамЧек.СуммаЧека, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
	СтрокаШК = СтрокаШК + "&fn=" + ВыбПарамЧек.НомерФН;
	СтрокаШК = СтрокаШК + "&i=" + Формат(ВыбПарамЧек.ФД, "ЧГ=");
	СтрокаШК = СтрокаШК + "&fp=" + ВыбПарамЧек.ФПД;
	СтрокаШК = СтрокаШК + "&n=" + Строка(ВыбПарамЧек.ТипЧека);
	
	ВозврЗначение.Вставить("СтрокаШК", СтрокаШК);
	
	Возврат ВозврЗначение;
КонецФункции
